Дошкольное_учреждение83/src/InformationRegisters/удуФИОФизЛиц/удуФИОФизЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>удуФИОФизЛиц</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Дошкольное_учреждение83/src/InformationRegisters/удуФИОФизЛиц/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура УстановитьЗаголовокФормыЗаписиФизлица()
	
	Если ЗначениеЗаполнено(Запись.ФизЛицо) Тогда
		Заголовок="Фамилия, имя, отчество физ. лица: "+Запись.ФизЛицо.Наименование;
	Иначе
		Заголовок="Фамилия, имя, отчество физ. лица: -";
	КонецЕсли;

КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьЗаголовокФормыЗаписиФизлица();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ФизЛицоПриИзменении(Элемент)
	
	УстановитьЗаголовокФормыЗаписиФизлица();
	
КонецПроцедуры
